package com.example.homework;

import android.app.Activity;
import android.content.Intent;
import android.database.Cursor;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.widget.Button;
import android.widget.TextView;

public class Result extends Activity {

	String s1,s2;
	Button myConstellation;
	Button hisContellation;
	TextView theAnswer;
	Constellation [] data=new Constellation[80];	
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.activity_result);
		
	    myConstellation=(Button) findViewById(R.id.button_myConstellation);
	    hisContellation=(Button) findViewById(R.id.button_hisConstellation);
	    theAnswer=(TextView) findViewById(R.id.textView_answer);
	    
		Intent intent=getIntent();
		s1=intent.getStringExtra("one");
		s2=intent.getStringExtra("two");
				
		myConstellation.setText(s1);
		hisContellation.setText(s2);
		//theAnswer.setText("配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4");
		
		for(int i=0;i<80;i++)
		{
			data[i]=new Constellation();
		}
		
		data[0].Set("白羊座", "白羊座", "配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[1].Set("白羊座", "金牛座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[2].Set("白羊座", "双子座", "配对指数：90\n配对比重：44.50\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[3].Set("白羊座", "巨蟹座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[4].Set("白羊座", "狮子座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生一对");
		data[5].Set("白羊座", "处女座", "配对指数：40\n配对比重：40.60\n两情相悦指数：3\n天长地久指数：1\n结果评述：前途不容乐观的一对");
		data[6].Set("白羊座", "天秤座", "配对指数：60\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：2\n结果评述：相互吸引又互相排斥一对");
		data[7].Set("白羊座", "天蝎座", "配对指数：40\n配对比重：60.40\n两情相悦指数：2\n天长地久指数：2\n结果评述：前途不容乐观的一对");
		data[8].Set("白羊座", "射手座", "配对指数：100\n配对比重：52.48\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生一对");
		data[9].Set("白羊座", "摩羯座", "配对指数：50\n配对比重：42.58\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[10].Set("白羊座", "水瓶座", "配对指数：90\n配对比重：56.44\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[11].Set("白羊座", "双鱼座", "配对指数：70\n配对比重：46.54\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		
		data[12].Set("金牛座", "金牛座", "配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[13].Set("金牛座", "双子座", "配对指数：90\n配对比重：44.50\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[14].Set("金牛座", "巨蟹座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[15].Set("金牛座", "狮子座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[16].Set("金牛座", "处女座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[17].Set("金牛座", "天秤座", "配对指数：40\n配对比重：40.60\n两情相悦指数：3\n天长地久指数：1\n结果评述：前途不容乐观的一对");
		data[18].Set("金牛座", "天蝎座", "配对指数：60\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：2\n结果评述：相互又相互吸引的一对");
		data[19].Set("金牛座", "射手座", "配对指数：40\n配对比重：60.40\n两情相悦指数：2\n天长地久指数：2\n结果评述：前途不容乐观的一对");
		data[20].Set("金牛座", "摩羯座", "配对指数：100\n配对比重：52.48\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[21].Set("金牛座", "水瓶座", "配对指数：50\n配对比重：42.58\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[22].Set("金牛座", "双鱼座", "配对指数：80\n配对比重：56.44\n两情相悦指数：4\n天长地久指数：4\n结果评述：非常理想的一对");
		
		data[23].Set("双子座", "双子座", "配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[24].Set("双子座", "巨蟹座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[25].Set("双子座", "狮子座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[26].Set("双子座", "处女座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力的一对");
		data[27].Set("双子座", "天秤座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[28].Set("双子座", "天蝎座", "配对指数：40\n配对比重：40.60\n两情相悦指数：3\n天长地久指数：1\n结果评述：前途不容乐观的一对");
		data[29].Set("双子座", "射手座", "配对指数：60\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引有互相排斥的一对");
		data[30].Set("双子座", "摩羯座", "配对指数：40\n配对比重：60.40\n两情相悦指数：2\n天长地久指数：2\n结果评述：前途不容乐观的一对");
		data[31].Set("双子座", "水瓶座", "配对指数：100\n配对比重：52.48\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[32].Set("双子座", "双鱼座", "配对指数：50\n配对比重：42.58\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		
		data[33].Set("巨蟹座", "巨蟹座", "配对指数：80\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[34].Set("巨蟹座", "狮子座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[35].Set("巨蟹座", "处女座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[36].Set("巨蟹座", "天秤座", "配对指数：60\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引又互相排斥的一对");
		data[37].Set("巨蟹座", "天蝎座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[38].Set("巨蟹座", "射手座", "配对指数：40\n配对比重：40.60\n两情相悦指数：3\n天长地久指数：1\n结果评述：前途不容乐观的一对");
		data[39].Set("巨蟹座", "水瓶座", "配对指数：40\n配对比重：60.40\n两情相悦指数：2\n天长地久指数：2\n结果评述：前途不容乐观的一对");
		data[40].Set("巨蟹座", "摩羯座", "配对指数：60\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引有互相排斥的一对");
		data[41].Set("巨蟹座", "双鱼座", "配对指数：100\n配对比重：52.48\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
        
		data[42].Set("狮子座", "狮子座", "配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对 ");
		data[43].Set("狮子座", "处女座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[44].Set("狮子座", "天秤座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[45].Set("狮子座", "天蝎座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[46].Set("狮子座", "射手座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[47].Set("狮子座", "摩羯座", "配对指数：40\n配对比重：40.60\n两情相悦指数：3\n天长地久指数：1\n结果评述：前途不容乐观的一对");
		data[48].Set("狮子座", "水瓶座", "配对指数：60\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引有互相排斥的一对");
		data[49].Set("狮子座", "双鱼座", "配对指数：40\n配对比重：60.40\n两情相悦指数：2\n天长地久指数：2\n结果评述：前途不容乐观的一对");
		
		data[50].Set("处女座", "处女座", "配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[51].Set("处女座", "天秤座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[52].Set("处女座", "天蝎座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[53].Set("处女座", "射手座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[54].Set("处女座", "摩羯座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[55].Set("处女座", "水瓶座", "配对指数：40\n配对比重：40.60\n两情相悦指数：2\n天长地久指数：1\n结果评述：前途不容乐观的一对");
		data[56].Set("处女座", "双鱼座", "配对指数：60\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引又互相排斥的一对");
		
		data[57].Set("天秤座", "天秤座", "配对指数：80\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引又互相排斥的一对");
		data[58].Set("天秤座", "天蝎座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[59].Set("天秤座", "射手座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[60].Set("天秤座", "摩羯座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：努力维持的一对");
		data[61].Set("天秤座", "水瓶座", "配对指数：100\n配对比重：48.52\n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
		data[62].Set("天秤座", "双鱼座", "配对指数：40\n配对比重：40.60\n两情相悦指数：3\n天长地久指数：1\n结果评述：前途不容乐观的一对");
        
		data[63].Set("天蝎座", "天蝎座", "配对指数：80\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：2\n结果评述：互相吸引又互相排斥的一对");
		data[64].Set("天蝎座", "射手座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[65].Set("天蝎座", "摩羯座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[66].Set("天蝎座", "水瓶座", "配对指数：50\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");
		data[67].Set("天蝎座", "双鱼座", "配对指数：100\n配对比重：48.52n两情相悦指数：5\n天长地久指数：5\n结果评述：天生的一对");
 
		data[68].Set("射手座", "射手座", "配对指数：80\n配对比重：50.50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[69].Set("射手座", "摩羯座", "配对指数：70\n配对比重：54.46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对");
		data[70].Set("射手座", "水瓶座", "配对指数：90\n配对比重：44.56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对");
		data[71].Set("射手座", "双鱼座", "配对指数：90\n配对比重：58.42\n两情相悦指数：3\n天长地久指数：2\n结果评述：需要努力维持的一对");

		data[72].Set("摩羯座","摩羯座","配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：还蛮不错的一对");
		data[73].Set("摩羯座","水瓶座","配对指数：70\n配对比重：54:46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对 ");
		data[74].Set("摩羯座","双鱼座","配对指数：90\n配对比重：44:56\n两情相悦指数：5\n天长地久指数：4\n结果评述：非常理想的一对 ");
		
		data[75].Set("水瓶座","水瓶座","配对指数：80\n配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对");
		data[76].Set("水瓶座","双鱼座","配对指数：70\n配对比重：54:46\n两情相悦指数：4\n天长地久指数：3\n结果评述：还蛮不错的一对 ");
		
		data[77].Set("双鱼座","双鱼座","配对指数：80\n 配对比重：50:50\n两情相悦指数：4\n天长地久指数：4\n结果评述：相当理想的一对 ");
		
		for(int i=0;i<72;i++)
		{
			if((s1.equals(data[i].myConstellation)&&s2.equals(data[i].hisConstellation))
					||(s1.equals(data[i].hisConstellation)&&s2.equals(data[i].myConstellation)))
			{
				theAnswer.setText(data[i].details);break;
			}
		}
	
	}
    
	
}
